{"config": [{"class_name": "Conv2D", "config": {"strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "bias_constraint": null, "activation": "linear", "name": "conv2d_21", "filters": 32, "batch_input_shape": [null, 1, 50, 50], "data_format": "channels_first", "kernel_constraint": null, "dilation_rate": [1, 1], "padding": "same", "bias_regularizer": null, "use_bias": true, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "kernel_regularizer": null, "kernel_size": [3, 3], "dtype": "float32"}}, {"class_name": "Activation", "config": {"name": "activation_21", "activation": "relu", "trainable": true}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "activation": "linear", "name": "conv2d_22", "filters": 32, "data_format": "channels_first", "dilation_rate": [1, 1], "padding": "valid", "bias_constraint": null, "bias_regularizer": null, "use_bias": true, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "kernel_regularizer": null, "kernel_size": [3, 3], "kernel_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_22", "activation": "relu", "trainable": true}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "activation": "linear", "name": "conv2d_23", "filters": 32, "data_format": "channels_first", "dilation_rate": [1, 1], "padding": "valid", "bias_constraint": null, "bias_regularizer": null, "use_bias": true, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "kernel_regularizer": null, "kernel_size": [3, 3], "kernel_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_23", "activation": "relu", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "pool_size": [2, 2], "padding": "valid", "name": "max_pooling2d_4", "trainable": true, "data_format": "channels_first"}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "activation": "linear", "name": "conv2d_24", "filters": 16, "data_format": "channels_first", "dilation_rate": [1, 1], "padding": "valid", "bias_constraint": null, "bias_regularizer": null, "use_bias": true, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "kernel_regularizer": null, "kernel_size": [3, 3], "kernel_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_24", "activation": "relu", "trainable": true}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "activation": "linear", "name": "conv2d_25", "filters": 16, "data_format": "channels_first", "dilation_rate": [1, 1], "padding": "valid", "bias_constraint": null, "bias_regularizer": null, "use_bias": true, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "kernel_regularizer": null, "kernel_size": [3, 3], "kernel_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_25", "activation": "relu", "trainable": true}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "activation": "linear", "name": "conv2d_26", "filters": 16, "data_format": "channels_first", "dilation_rate": [1, 1], "padding": "valid", "bias_constraint": null, "bias_regularizer": null, "use_bias": true, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "kernel_regularizer": null, "kernel_size": [3, 3], "kernel_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_26", "activation": "relu", "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_4", "trainable": true}}, {"class_name": "Dropout", "config": {"rate": 0.2, "name": "dropout_1", "trainable": true}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "bias_constraint": null, "units": 512, "name": "dense_1", "kernel_constraint": null, "bias_regularizer": null, "use_bias": true, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "kernel_regularizer": null, "activation": "linear"}}, {"class_name": "Activation", "config": {"name": "activation_27", "activation": "relu", "trainable": true}}, {"class_name": "Dropout", "config": {"rate": 0.2, "name": "dropout_2", "trainable": true}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "bias_constraint": null, "units": 64, "name": "dense_2", "kernel_constraint": null, "bias_regularizer": null, "use_bias": true, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "kernel_regularizer": null, "activation": "linear"}}, {"class_name": "Activation", "config": {"name": "activation_28", "activation": "relu", "trainable": true}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "bias_constraint": null, "units": 10, "name": "dense_3", "kernel_constraint": null, "bias_regularizer": null, "use_bias": true, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "kernel_regularizer": null, "activation": "linear"}}, {"class_name": "Activation", "config": {"name": "activation_29", "activation": "softmax", "trainable": true}}], "class_name": "Sequential", "keras_version": "2.0.8", "backend": "tensorflow"}