{"config": [{"config": {"name": "conv2d_1", "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activation": "linear", "dilation_rate": [1, 1], "kernel_size": [5, 5], "batch_input_shape": [null, 1, 50, 50], "kernel_constraint": null, "padding": "same", "data_format": "channels_first", "dtype": "float32", "kernel_regularizer": null, "strides": [1, 1], "trainable": true, "activity_regularizer": null, "bias_constraint": null, "filters": 20, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "bias_regularizer": null}, "class_name": "Conv2D"}, {"config": {"name": "activation_1", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"name": "max_pooling2d_1", "strides": [2, 2], "pool_size": [2, 2], "trainable": true, "data_format": "channels_first", "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"name": "conv2d_2", "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activation": "linear", "dilation_rate": [1, 1], "kernel_size": [5, 5], "padding": "same", "data_format": "channels_first", "kernel_constraint": null, "strides": [1, 1], "kernel_regularizer": null, "filters": 50, "trainable": true, "activity_regularizer": null, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "bias_regularizer": null}, "class_name": "Conv2D"}, {"config": {"name": "activation_2", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"name": "max_pooling2d_2", "strides": [2, 2], "pool_size": [2, 2], "trainable": true, "data_format": "channels_first", "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"name": "dense_1", "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activation": "linear", "kernel_constraint": null, "units": 500, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "trainable": true, "activity_regularizer": null, "bias_constraint": null, "use_bias": true, "bias_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "activation_3", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"name": "dense_2", "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activation": "linear", "kernel_constraint": null, "units": 10, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "trainable": true, "activity_regularizer": null, "bias_constraint": null, "use_bias": true, "bias_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "activation_4", "activation": "softmax", "trainable": true}, "class_name": "Activation"}], "class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.0.8"}